nam348tnh3gp/ESP32-Lottery/ESP_Code.ino
/*
 * ESP32/ESP8266 Lottery Miner v1.3 - Auto Core Detection
 * - Auto-detect single/dual core
 * - Full cross-platform support (ESP32/S2/C3/S3/ESP8266)
 * - Watchdog Timer (platform-adaptive)
 * - Auto Pool Failover (TCP + TLS)
 * - Manual Pool Switch
 * - WiFi Manager
 * - mDNS
 * - TLS/SSL Support (WSS)
 */

#include <Arduino.h>

// ==================== PLATFORM DETECTION ====================
#if defined(ESP8266)
    #include <ESP8266WiFi.h>
    #include <ESP8266mDNS.h>
    #include <ESPAsyncTCP.h>
    #define PLATFORM_NAME "ESP8266"
    #define PLATFORM_SINGLE_CORE
#elif defined(ESP32)
    #include <WiFi.h>
    #include <ESPmDNS.h>
    #include <AsyncTCP.h>
    
    // Detect ESP32 variant
    #if defined(CONFIG_FREERTOS_UNICORE) || defined(ESP32S2) || defined(ESP32C3) || defined(ESP32S3)
        #define PLATFORM_SINGLE_CORE
        #if defined(ESP32S2)
            #define PLATFORM_NAME "ESP32-S2"
        #elif defined(ESP32C3)
            #define PLATFORM_NAME "ESP32-C3"
        #elif defined(ESP32S3)
            #define PLATFORM_NAME "ESP32-S3"
        #else
            #define PLATFORM_NAME "ESP32 (Unicore)"
        #endif
    #else
        #define PLATFORM_DUAL_CORE
        #define PLATFORM_NAME "ESP32"
    #endif
#endif

#include <WiFiManager.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include "DSHA2.h"

#ifdef ESP32
    #include "esp_task_wdt.h"
#endif

// Conditional includes - chỉ include khi KHÔNG disable
#ifndef DISABLE_WEB_DASHBOARD
    #include <ESPAsyncWebServer.h>
#endif

// ==================== AUTO CORE DETECTION ====================
#ifdef SINGLE_CORE_MODE
    #warning "Single core mode forced by user"
    #ifdef PLATFORM_DUAL_CORE
        #undef PLATFORM_DUAL_CORE
        #define PLATFORM_SINGLE_CORE
    #endif
#endif

#ifdef PLATFORM_DUAL_CORE
    #define MINING_DUAL_CORE 1
    #define CORE_COUNT 2
#else
    #define MINING_DUAL_CORE 0
    #define CORE_COUNT 1
#endif

// ==================== CONFIG ====================
#define PREF_NAMESPACE "miner"
#define PREF_POOL_HOST "pool_host"
#define PREF_POOL_PORT "pool_port"
#define PREF_BTC_ADDR  "btc_addr"
#define PREF_WALLET    "wallet"
#define MDNS_NAME      "esp-miner"
#define WDT_TIMEOUT    30
#define MINER_VERSION  "1.3"

// Backup pools list - Hỗ trợ cả TCP và TLS
const char* backupPools[] = {
    "public-pool.io",       // 0: TCP 3333
    "public-pool.io",       // 1: TLS 4333
    "pool.vkbit.com",       // 2: TCP 3333
    "stratum.slushpool.com" // 3: TCP 3333
};
const uint16_t backupPorts[] = {3333, 4333, 3333, 3333};
const bool backupUseSSL[] = {false, true, false, false};
const int NUM_BACKUP_POOLS = 4;
int currentPoolIndex = 0;

// Mặc định - Port 3333 cho TCP
String poolHost = "public-pool.io";
uint16_t poolPort = 3333;
String btcAddress = "";
String walletName = "ESP32";

// ==================== GLOBALS ====================
#if defined(ESP32)
    Preferences prefs;
#else
    #include <EEPROM.h>
    // ESP8266 lưu config đơn giản vào EEPROM
    struct Config {
        char poolHost[32] = "public-pool.io";
        uint16_t poolPort = 3333;
        char btcAddress[64] = "";
        char walletName[16] = "ESP8266";
    } config;
#endif

WebSocketsClient stratumWS;
DSHA256 sha;

// Conditional web server declaration
#ifndef DISABLE_WEB_DASHBOARD
AsyncWebServer webServer(80);
#endif

// Mining state
volatile bool jobReceived = false;
uint8_t header[80];
uint8_t target[32];
String jobId;
volatile unsigned long hashesCore0 = 0;
volatile unsigned long hashesCore1 = 0;
volatile float currentHashrate = 0.0f;
volatile bool miningActive = false;
String currentIP = "";

// Nonce ranges cho dual-core
volatile uint32_t nonceStart = 0;
volatile uint32_t nonceFound = 0;
volatile bool solutionFound = false;
volatile bool shouldStopMining = false;

// Timing
unsigned long lastJobTime = 0;
unsigned long lastReport = 0;
unsigned long lastReconnectAttempt = 0;

// RTOS
#if CORE_COUNT == 2
    TaskHandle_t miningTask0 = NULL;
    TaskHandle_t miningTask1 = NULL;
#else
    TaskHandle_t miningTask0 = NULL;
#endif
SemaphoreHandle_t submitMutex;

// ==================== HTML DASHBOARD (chỉ khi không disable) ====================
#ifndef DISABLE_WEB_DASHBOARD
const char dashboard_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <title>ESP Miner v4.0 - Auto Core</title>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <style>
        body { font-family: Arial; background: #1a1a2e; color: #eee; padding: 20px; }
        .card { background: #16213e; border-radius: 10px; padding: 20px; margin: 10px 0; }
        .value { font-size: 2em; color: #0f0; font-family: monospace; }
        .label { color: #aaa; }
        .highlight { color: #ffaa00; }
        input, select, button { padding: 10px; margin: 5px; border-radius: 5px; border: none; }
        button { background: #0f3460; color: white; cursor: pointer; }
        button:hover { background: #e94560; }
        .status { color: #0f0; }
        .config-panel { display: none; }
        .ip-box { background: #0f3460; padding: 10px; border-radius: 5px; font-family: monospace; }
        .btn-group { display: flex; flex-wrap: wrap; gap: 5px; }
        .btn-group button { flex: 1; min-width: 120px; }
        .pool-badge { 
            display: inline-block; 
            background: #e94560; 
            color: white; 
            padding: 2px 8px; 
            border-radius: 12px; 
            font-size: 0.8em; 
            margin-left: 5px; 
        }
        .tls-badge {
            display: inline-block;
            background: #00aa00;
            color: white;
            padding: 2px 8px;
            border-radius: 12px;
            font-size: 0.8em;
            margin-left: 5px;
        }
        .chip-badge {
            display: inline-block;
            background: #ff6600;
            color: white;
            padding: 2px 8px;
            border-radius: 12px;
            font-size: 0.8em;
            margin-left: 5px;
        }
        .info-note {
            background: #0f3460;
            padding: 10px;
            border-radius: 5px;
            margin-top: 10px;
            font-size: 0.9em;
        }
    </style>
</head>
<body>
    <h1>🎰 ESP Miner v4.0 <span id='chipBadge' class='chip-badge'>Auto-Detect</span></h1>
    
    <div class='card'>
        <span class='label'>🌐 Dashboard Access:</span><br>
        <div style='margin-top:10px;'>
            <span class='label'>IP Address:</span> 
            <span id='ipAddress' class='ip-box'>Loading...</span>
            <button onclick='copyIP()' style='padding:5px 10px; margin-left:10px;'>📋 Copy</button>
        </div>
        <div style='margin-top:5px;'>
            <span class='label'>mDNS:</span> 
            <span class='highlight'>http://esp-miner.local</span>
        </div>
    </div>
    
    <div class='card'>
        <span class='label'>⛏️ Status:</span> 
        <span id='status' class='status'>Connecting...</span>
    </div>
    
    <div class='card'>
        <span class='label'>⚡ Total Hashrate:</span>
        <div id='hashrate' class='value'>0.00 H/s</div>
    </div>
    
    <div id='coreStatsContainer'></div>
    
    <div class='card'>
        <span class='label'>📊 Total Hashes:</span>
        <div id='totalHashes' class='value'>0</div>
    </div>
    
    <div class='card'>
        <span class='label'>🔢 Nonce Range:</span>
        <div id='nonce' class='value'>0 - 0</div>
    </div>
    
    <div class='card'>
        <span class='label'>🖥️ Current Pool:</span>
        <div id='poolInfo' style='font-size:1.2em;'>-</div>
        <div style='margin-top:10px;'>
            <span class='label'>🔄 Backup Pools:</span>
            <div id='backupPools' style='color:#aaa; margin-top:5px;'>-</div>
        </div>
    </div>
    
    <div class='card'>
        <span class='label'>💳 BTC Address:</span>
        <div id='btcInfo' style='word-break:break-all;'>-</div>
        <div style='margin-top:10px;'>
            <span class='label'>👤 Worker:</span>
            <span id='workerInfo'>-</span>
        </div>
    </div>
    
