nam348tnh3gp/ESP32-Lottery/ESP_Code.ino
void saveConfigEEPROM() {
    strncpy(config.poolHost, poolHost.c_str(), 31);
    config.poolPort = poolPort;
    strncpy(config.btcAddress, btcAddress.c_str(), 63);
    strncpy(config.walletName, walletName.c_str(), 15);
    EEPROM.begin(sizeof(Config));
    EEPROM.put(0, config);
    EEPROM.commit();
    EEPROM.end();
}

void saveCurrentPool() {
    strncpy(config.poolHost, poolHost.c_str(), 31);
    config.poolPort = poolPort;
    EEPROM.begin(sizeof(Config));
    EEPROM.put(0, config);
    EEPROM.commit();
    EEPROM.end();
}
#else
void loadConfig() {
    prefs.begin(PREF_NAMESPACE, false);
    poolHost = prefs.getString(PREF_POOL_HOST, "public-pool.io");
    poolPort = prefs.getUShort(PREF_POOL_PORT, 3333);
    btcAddress = prefs.getString(PREF_BTC_ADDR, "");
    walletName = prefs.getString(PREF_WALLET, "ESP32");
    prefs.end();
}

void saveCurrentPool() {
    prefs.begin(PREF_NAMESPACE, false);
    prefs.putString(PREF_POOL_HOST, poolHost);
    prefs.putUShort(PREF_POOL_PORT, poolPort);
    prefs.end();
}
#endif

// ==================== SHARED UTILS ====================
uint8_t hexToByte(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    return 0;
}

void hexToBytes(const char* hex, uint8_t* bytes, size_t len) {
    for (size_t i = 0; i < len; i++) {
        bytes[i] = (hexToByte(hex[i*2]) << 4) | hexToByte(hex[i*2+1]);
    }
}

void reverseBytes(uint8_t* data, size_t len) {
    for (size_t i = 0; i < len / 2; i++) {
        uint8_t tmp = data[i];
        data[i] = data[len - 1 - i];
        data[len - 1 - i] = tmp;
    }
}

bool checkTarget(uint8_t* hash) {
    for (int i = 31; i >= 0; i--) {
        if (hash[i] < target[i]) return true;
        if (hash[i] > target[i]) return false;
    }
    return false;
}

void switchToNextPool() {
    currentPoolIndex = (currentPoolIndex + 1) % NUM_BACKUP_POOLS;
    poolHost = backupPools[currentPoolIndex];
    poolPort = backupPorts[currentPoolIndex];
    saveCurrentPool();
    Serial.printf("🔄 Switched to pool: %s:%d (Index: %d, %s)\n", 
                 poolHost.c_str(), poolPort, currentPoolIndex,
                 backupUseSSL[currentPoolIndex] ? "TLS" : "TCP");
}

// ==================== STRATUM ====================
void stratumSend(const char* json) {
    if (stratumWS.isConnected()) {
        stratumWS.sendTXT(json);
    }
}

void stratumSubscribe() {
    StaticJsonDocument<200> doc;
    doc["id"] = 1;
    doc["method"] = "mining.subscribe";
    JsonArray params = doc.createNestedArray("params");
    
    String userAgent = walletName + "/" + MINER_VERSION;
    params.add(userAgent);
    
    String json;
    serializeJson(doc, json);
    stratumSend(json.c_str());
    
    Serial.println("📡 Subscribing as: " + userAgent);
}

void stratumAuthorize() {
    StaticJsonDocument<200> doc;
    doc["id"] = 2;
    doc["method"] = "mining.authorize";
    JsonArray params = doc.createNestedArray("params");
    
    String username = btcAddress + "." + walletName;
    params.add(username);
    params.add("x");
    
    String json;
    serializeJson(doc, json);
    stratumSend(json.c_str());
    
    Serial.println("🔑 Authorizing as: " + username);
}

void stratumSubmit(uint32_t foundNonce) {
    StaticJsonDocument<300> doc;
    doc["id"] = 4;
    doc["method"] = "mining.submit";
    JsonArray params = doc.createNestedArray("params");
    
    String username = btcAddress + "." + walletName;
    params.add(username);
    params.add(jobId);
    params.add("");
    params.add("");
    params.add(String(foundNonce, HEX));
    
    String json;
    serializeJson(doc, json);
    stratumSend(json.c_str());
    
    Serial.println("🎯 SUBMITTED NONCE: 0x" + String(foundNonce, HEX));
}

// ==================== WATCHDOG PLATFORM-ADAPTIVE ====================
void watchdogSetup() {
#ifdef ESP32
    esp_task_wdt_init(WDT_TIMEOUT, true);
    esp_task_wdt_add(NULL);
#endif
    // ESP8266: SDK tự quản lý WDT, chỉ cần gọi yield()/delay() thường xuyên
}

void watchdogReset() {
#ifdef ESP32
    esp_task_wdt_reset();
#else
    yield();
#endif
}

// ==================== MINING TASK ====================
void miningTask(void* parameter) {
    int coreId = (int)parameter;
    Serial.printf("⛏️ Mining task started on Core %d\n", coreId);
    
#ifdef ESP32
    esp_task_wdt_add(NULL);
#endif
    
    uint8_t localHeader[80];
    unsigned long* hashesCounter;
    
#if CORE_COUNT == 2
    hashesCounter = (coreId == 0) ? (unsigned long*)&hashesCore0 : (unsigned long*)&hashesCore1;
#else
    hashesCounter = (unsigned long*)&hashesCore0;
#endif
    
    while (true) {
        watchdogReset();
        
        if (shouldStopMining) {
            vTaskDelay(10 / portTICK_PERIOD_MS);
            continue;
        }
        
        if (jobReceived && !solutionFound) {
            memcpy(localHeader, (void*)header, 80);
            
            uint32_t startNonce, endNonce;
            
#if CORE_COUNT == 2
            if (coreId == 0) {
                startNonce = nonceStart;
                endNonce = nonceStart + 0x7FFFFFFF;
            } else {
                startNonce = nonceStart + 0x80000000;
                endNonce = 0xFFFFFFFF;
            }
#else
            startNonce = nonceStart;
            endNonce = nonceStart + 0x00FFFFFF;  // Phạm vi nhỏ hơn cho single core
#endif
            
            for (uint32_t n = startNonce; n <= endNonce && !solutionFound && !shouldStopMining; n++) {
                uint32_t nonceLE = n;
                memcpy(localHeader + 76, &nonceLE, 4);
                
                uint8_t hash[32];
                sha.hashBlockHeader(localHeader, hash);
                (*hashesCounter)++;
                
                if (checkTarget(hash)) {
                    if (xSemaphoreTake(submitMutex, portMAX_DELAY) == pdTRUE) {
                        if (!solutionFound) {
                            solutionFound = true;
                            nonceFound = n;
                            Serial.printf("🏆 BLOCK FOUND by Core %d! Nonce: 0x%08X\n", coreId, n);
                        }
                        xSemaphoreGive(submitMutex);
                    }
                    break;
                }
                
                if ((n & 0xFF) == 0) {  // Tăng tần suất reset WDT
                    vTaskDelay(0);
                    watchdogReset();
                }
            }
        }
        
        vTaskDelay(1 / portTICK_PERIOD_MS);
    }
}

// ==================== STRATUM EVENT ====================
void stratumEvent(WStype_t type, uint8_t* payload, size_t length) {
    switch(type) {
        case WStype_DISCONNECTED:
            Serial.println("❌ Pool disconnected: " + poolHost);
            miningActive = false;
            jobReceived = false;
            shouldStopMining = true;
            switchToNextPool();
            delay(3000);
            stratumConnect();
            break;
            
        case WStype_CONNECTED:
            Serial.println("✅ Connected to pool: " + poolHost + ":" + String(poolPort));
            stratumSubscribe();
            break;
            
        case WStype_TEXT:
            {
                StaticJsonDocument<1024> doc;
                DeserializationError err = deserializeJson(doc, payload, length);
                if (err) {
                    Serial.printf("⚠️ JSON parse error: %s\n", err.c_str());
                    return;
                }
                
                const char* method = doc["method"];
                if (method && strcmp(method, "mining.notify") == 0) {
                    JsonArray params = doc["params"];
                    jobId = params[0].as<String>();
                    
                    const char* prevHashHex = params[1];
                    hexToBytes(prevHashHex, header + 4, 32);
                    reverseBytes(header + 4, 32);
                    
                    const char* merkleHex = params[3];
                    hexToBytes(merkleHex, header + 36, 32);
                    reverseBytes(header + 36, 32);
                    
                    const char* versionHex = params[5];
                    hexToBytes(versionHex, header, 4);
                    reverseBytes(header, 4);
                    
